# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран
a = 12
b = 12.5
c = "текст"
print(a, b, c)
num = input("Введите цену: ")
count = input("Введите количество: ")
print("Итого: ", float(num) * int(count))
